TOOL:	xrun	21.03-s009: Started on Nov 09, 2023 at 08:50:08 CET
xrun
	-F ../tb/tb.f
		../../common/vdic_dut_2023.svp
		mult_bfm.sv
		tpgen.sv
		coverage.sv
		scoreboard.sv
		top.sv
	-v93
	+nowarnDSEM2009
	+nowarnDSEMEL
	+nowarnCGDEFN
	+nowarnCOVUTA
	+nowarnBADPRF
	+nowarnXCLGNOPTM
	+nowarnRNDXCELON
	+nowarnSAWSTP
	-xmlibdirname INCA_libs_gui
	+access+r
	+gui
	+overwrite
	-nocopyright
	-coverage all
	-covoverwrite
	-covfile xrun_covfile.txt
	+UVM_TESTNAME=lab03
	-l xrun_gui.log
Compiling UVM packages (uvm_pkg.sv cdns_uvm_pkg.sv) using uvmhome location /eda/cadence/2021-22/RHELx86/XCELIUM_21.03.009/tools/methodology/UVM/CDNS-1.1d
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		top

	Extracting FSMs for coverage:
		worklib.tpgen
		worklib.coverage
		worklib.scoreboard
		worklib.top
	Total FSMs extracted = 0
	Building instance overlay tables: .................... Done
	Enabling instrumentation for coverage types: block expression FSM toggle functional
	Building instance specific data structures.
	Performing constant object marking (COM) analysis.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                Instances  Unique
		Modules:                5       5
		Interfaces:             1       1
		Registers:             83      83
		Scalar wires:          17       -
		Vectored wires:        10       -
		Always blocks:          3       3
		Initial blocks:         6       6
		Final blocks:           1       1
		Cont. assignments:      8      10
		Pseudo assignments:    12      12
		Assertions:             1       1
		Covergroup Instances:   0       2
	Writing initial simulation snapshot: worklib.top:sv

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /eda/cadence/2021-22/RHELx86/XCELIUM_21.03.009/tools/xcelium/files/xmsimrc
xcelium> source /eda/cadence/2021-22/RHELx86/XCELIUM_21.03.009/tools/methodology/UVM/CDNS-1.1d/additions/sv/files/tcl/uvm_sim.tcl
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> probe -create -shm top.DUT.rst_n top.DUT.result_rdy top.DUT.result_parity top.DUT.result top.DUT.req top.DUT.clk top.DUT.arg_parity_error top.DUT.arg_b_parity top.DUT.arg_b top.DUT.arg_a_parity top.DUT.arg_a top.DUT.ack
Created probe 1
xcelium> run
60 NS + 0 (Assertion output stop: top.scoreboard_i.scoreboard_be_blk.verify_result.CHK_RESULT = failed)
xmsim: *E,ASRTST (../tb/scoreboard.sv,105): (time 60 NS) Assertion top.scoreboard_i.scoreboard_be_blk.verify_result.CHK_RESULT has failed
60 Test FAILED for arg_a=x arg_b=x 
 Expected:           x  received:           0
xcelium> run
[1;30m[101m-----------------------------------
----------- Test FAILED -----------
-----------------------------------[0m

Simulation complete via $finish(1) at time 67870 NS + 0
../tb/tpgen.sv:227     $finish;
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> scope -set top.DUT
xcelium> 